{
    "profilePicture": "https://cdn.discordapp.com/banners/469171963236057120/a_3bd70c858228687f5cf44eb27841ee25.gif?size=1024",
    "mepersonally": "My name is ServerBP, a 17-year-old from Hungary with a lifelong curiosity for technology. My journey into the world of programming began at the age of 8, when I first explored Scratch, a visual programming language for beginners. Soon after, I transitioned to working with Arduino, where I not only learned C++ but also developed a deep understanding of electronics. As a young child, I was always fascinated by how computers and devices functioned, which led me to explore more about hardware and software at an early age. During my early years, I spent a significant amount of time experimenting with Raspberry Pi, which opened the door to coding and creating projects such as Discord bots. While I pursued my passion for programming, I also enjoyed playing games like Beat Saber, where I managed to set multiple high scores and global records. Although gaming played a big role in my life, I have always balanced it with my academic pursuits. Currently, I am in the final year of the International Baccalaureate program, where I focus on a well-rounded education that helps me stay curious and open-minded. Through my studies and experiences, I’ve developed a strong passion for programming and technology, which continues to shape my future aspirations.",
    "meonline": "Hi! I’m ServerBP, a 17-year-old developer with a love for all things tech. I started programming when I was 8, and since then, I've worked with a wide range of programming languages and technologies. My first dive into coding began with Scratch, and I quickly moved on to Arduino, where I learned C++ and electronics. Soon after, I got into Raspberry Pi and started creating Discord bots, which is where my interest in working with APIs began. Currently, I’m heavily involved in the Beat Saber community, where I not only compete but also help organize tournaments. I’ve developed software for one of the largest tournament organizers in the scene and even coordinate tournaments like the Beat Saber World Cup and Beat Saber Challenge Cup. Aside from Beat Saber, I’m always looking for new ways to expand my programming skills, and I try to keep an active GitHub portfolio where I post utilities and tools that others in the community might find useful. In addition to my coding projects, I’m passionate about collaborating with others and pushing my limits. Whether it's for gaming, coding, or just discussing tech, I’m always online and ready to chat!",
    "socialLinks": {
        "github": "https://github.com/ServerBP",
        "youtube": "https://youtube.com/serverbp0001",
        "twitch": "https://twitch.tv/serverbp",
        "discord": "https://discord.gg/yourinvite",
        "twitter": "https://twitter.com/serverbp_dev",
        "email": "mailto:serverbp@serverbp.dev",
        "beatleader": "https://beatleader.xyz/u/76561199016011545",
        "scoresaber": "https://scoresaber.com/u/76561199016011545"
    },
    "projects": [
      {
        "name": "BeatKhana Tournament Management System",
        "image": "https://beatkhana.com/assets/images/2147484280_KcsUELlLKgSAivJ.webp",
        "link": "https://github.com/ServerBP/coordPanel"
      },
      {
        "name": "My About Me site",
        "image": "icons/beatleaderAvatar.png",
        "link": "https://github.com/ServerBP/mainSite"
      },
      {
        "name": "The school calendar",
        "image": "icons/svelte.svg",
        "link": "https://calendar.serverbp.work"
      },
      {
        "name": "Earth-Sun Orbit system",
        "image": "icons/svelte.svg",
        "link": "https://earth-sun-orbit.serverbp.work"
      }
    ]
  }